Revit 2026 API

# StructuralConnectionHandlerCreate(Document, IListElementId, ElementId) Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static StructuralConnectionHandler Create(
	Document document,
	IList<ElementId> idsToConnect,
	ElementId typeId
)
```
```vb
Public Shared Function Create (
	document As Document,
	idsToConnect As IList(Of ElementId),
	typeId As ElementId
) As StructuralConnectionHandler
```
```cpp
public:
static StructuralConnectionHandler^ Create(
	Document^ document,
	IList<ElementId^>^ idsToConnect,
	ElementId^ typeId
)
```
```fsharp
static member Create :
        document : Document *
        idsToConnect : IList<ElementId> *
        typeId : ElementId -> StructuralConnectionHandler
```

#### Parameters

document Document

idsToConnect IListElementId

typeId ElementId

#### Return Value

StructuralConnectionHandler

#### Reference

StructuralConnectionHandler Class

Create Overload

Autodesk.Revit.DB.Structure Namespace